extends Resource
class_name CommonEnums


# ------------------------------------------------------------
# Damage type (тип урона)
# ------------------------------------------------------------
enum DamageType {
	KINETIC,      # Kinetic (кинетический)
	ENERGY,       # Energy (энергетический)
	THERMAL       # Thermal (термический)
}

# ------------------------------------------------------------
# Platforms (платформы/носители)
# ------------------------------------------------------------
enum Platform {
	INFANTRY,     # Infantry (пехота)
	DRONE,        # Drones
	VEHICLE       # Vehicles (колёсная/гусеничная техника)	
}

# ------------------------------------------------------------
# Armor hit side (стороны попадания)
# ------------------------------------------------------------
enum HitSide {
	FRONT,
	BACK,
	LEFT,
	RIGHT
}

# ------------------------------------------------------------
# Weapon categories (категории оружия)
# ------------------------------------------------------------
enum WeaponCategory {
	MELEE,        # Melee weapon (нож, дубинка)
	FIREARM,      # Firearms (пистолет, автомат)
	THROWN,       # Thrown (гранаты)
	LASER,
	PLASMA	
}

# ------------------------------------------------------------
# Weapon handling (одна/две руки)
# ------------------------------------------------------------
enum Handling {
	ONE_HANDED,   # One-handed (одноручное)
	TWO_HANDED    # Two-handed (двухручное)
}
